cf_billing/DataProcessors/бестМассовоеОграничениеПодключениеСезонныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестМассовоеОграничениеПодключениеСезонныхУслуг</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргДлительностиПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДлительностиПериодов</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаСезонностиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаСезонностиУслуг</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемЗаПрошлыйГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректироватьГодовойОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентНеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестАктивностьТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестАктивностьТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВладельцыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВладельцыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПриборыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриборыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСостояниеПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСостояниеПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтруктураСетиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтруктураСетиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/бестМассовоеОграничениеПодключениеСезонныхУслуг/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОтборПоУзлам Тогда
		ЭтаФорма.Элементы.ВариантыОтбора.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ВариантыОтбора.Видимость = Ложь;
	КонецЕсли;
	Дата = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОбъектРасчета =  ВыбранноеЗначение;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ВидОперации = "СезонноеПодключениеУслуги" Тогда 
		СтандартнаяОбработка 	= Ложь;		
		СписокУслуг 			= ПолучитьСписокУслугДляВыбора();
		
		ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
	Иначе 
		СтандартнаяОбработка = Ложь;	
		
		СписокУслуг = бестПользовательскийВводСервер.ПолучитьСписокУслугДляВыбора(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()), Организация, Район, ОбъектРасчета, Неопределено);
		ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Элементы.ТЧПереподключение.Видимость =	ВидОперации = "СезонноеПодключениеУслуги";
КонецПроцедуры

&НаКлиенте
Процедура ТЧДатаОперацииПриИзменении(Элемент)
	ТекСтрока 						= Элементы.ТЧ.ТекущиеДанные;
	ТекСтрока.Флаг					= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоУзламПриИзменении(Элемент)
	Если ОтборПоУзлам Тогда
		ЭтаФорма.Элементы.ВариантыОтбора.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ВариантыОтбора.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	ОткрытьФорму("Справочник.бестОбъектыРасчета.ФормаВыбора",ПараметрыВыбора,ЭтаФорма);
//	
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧ

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	ТЧ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для каждого стр из ТЧ Цикл
		стр.Флаг = Истина;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого стр из ТЧ Цикл
		стр.Флаг = Ложь;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВсемТУОбъекта(Команда)
	ТекСтрока 						= Элементы.ТЧ.ТекущиеДанные;
	Если Не ТекСтрока					= Неопределено Тогда
		СтрОтбора						= Новый Структура("ОбъектРасчета", ТекСтрока.ОбъектРасчета);
		ИщемСтроки						= ТЧ.НайтиСтроки(СтрОтбора);
		Для н = 0 по ИщемСтроки.ВГраница() Цикл
			ИщемСтроки[н].ДатаОперации 	= ТекСтрока.ДатаОперации;
			ИщемСтроки[н].Флаг 			= ТекСтрока.Флаг;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДоков(Команда)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПередВыполнениемОбработки",ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	//ТЧ.Очистить();
	
	ТекСостояние								= Перечисления.энргСостояниеТочекУчета.Включена;
	Если ВидОперации							= "СезонноеОтключениеУслуги" Тогда
		ТекСостояниеУслуги                      = Перечисления.энргСостояниеУслуг.Подключена;
	ИначеЕсли ВидОперации						= "СезонноеПодключениеУслуги" Тогда 
		ТекСостояниеУслуги                      = Перечисления.энргСостояниеУслуг.Отключена;
	КонецЕсли; 
	
	Результат 									= ДействующиеТочкиУчетаПоУслуге(Дата,Организация,Район,Услуга, ГруппаОбъектовРасчета, ТекСостояние, ТекСостояниеУслуги, Договор, СтруктураСети); 
	Выборка  									= Результат.Выбрать();
	ТекТочкаУчета 								= Неопределено;
	
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		//Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
		//		СтрокаТочкиУчета  					= ТЧ.Добавить();
		//		ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);	
		//КонецЕсли;
		мСтроки  = ТЧ.НайтиСтроки(Новый Структура("Договор, ОбъектРасчета,ТочкаУчета,Услуга",Выборка.Договор,Выборка.ОбъектРасчета,Выборка.ТочкаУчета, Выборка.Услуга));
		Если мСтроки.Количество()  = 0 Тогда
			СтрокаТочкиУчета  					= ТЧ.Добавить();
			СтрокаТочкиУчета.НомерСтроки = Новый УникальныйИдентификатор();
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДействующиеТочкиУчетаПоУслуге(ТекПериод,ТекОрганизация,ТекРайон,ТекУслуга, ТекГруппаОбъектов, ТекСостояние, ТекСостояниеУслуги, Договор, СтруктураСети)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",					Новый Граница(ТекПериод,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			ТекОрганизация);
	Запрос.УстановитьПараметр("Район",					ТекРайон);
	Запрос.УстановитьПараметр("ТекСостояние",			ТекСостояние);
	Запрос.УстановитьПараметр("СостояниеУслуги",		ТекСостояниеУслуги);   
	Запрос.УстановитьПараметр("МоментВремени",			ТекПериод);

	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия,
	|	энргВидыУслуг.Ссылка КАК Услуга
	|ПОМЕСТИТЬ ОтопительныйПериод
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргДлительностиПериодов.Сезонность КАК Сезонность,
	|		ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|		МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|		ДЕНЬ(энргДлительностиПериодов.КонецПериода) КАК ДеньОкончания,
	|		МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|					И МЕСЯЦ(энргДлительностиПериодов.КонецПериода) >= МЕСЯЦ(&МоментВремени)
	|				ТОГДА ГОД(&МоментВремени) - 1
	|			ИНАЧЕ ГОД(&МоментВремени)
	|		КОНЕЦ КАК ГодНачало,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|					И МЕСЯЦ(энргДлительностиПериодов.КонецПериода) >= МЕСЯЦ(&МоментВремени)
	|				ТОГДА ГОД(&МоментВремени)
	|			ИНАЧЕ ГОД(&МоментВремени) + 1
	|		КОНЕЦ КАК ГодОкончания
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|			И (энргВидыУслуг.Ссылка = &Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаСезонностиУслуг.Организация КАК Организация,
	|	НастройкаСезонностиУслуг.Район КАК Район,
	|	НастройкаСезонностиУслуг.Услуга КАК Услуга,
	|	НастройкаСезонностиУслуг.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ОтопительныйПериод.Сезонность КАК Сезонность,
	|	ОтопительныйПериод.НачалоПериодаДействия КАК НачалоПериодаДействия,
	|	ОтопительныйПериод.КонецПериодаДействия КАК КонецПериодаДействия
	|ПОМЕСТИТЬ УслугиНеПрименятьСезонность
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК НастройкаСезонностиУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтопительныйПериод КАК ОтопительныйПериод
	|		ПО НастройкаСезонностиУслуг.Услуга = ОтопительныйПериод.Услуга
	|ГДЕ
	|	НастройкаСезонностиУслуг.Организация = &Организация
	|	И НастройкаСезонностиУслуг.Район = &Район
	|	И НЕ НастройкаСезонностиУслуг.НеПрименятьСезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = &ТекСостояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК энргВладельцыТочекУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета,
	|	АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	ТочкиУчетаОбъекта КАК ТочкиУчетаОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
	|		ПО ТочкиУчетаОбъекта.ТочкаУчета = АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочекУчета
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестПриборыТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыТочекУчета.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыДействующихТочек
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыТочекУчета КАК ПриборыТочекУчета
	|		ПО ДействующиеТочкиУчета.ТочкаУчета = ПриборыТочекУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ДействующиеТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|						ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						ДействующиеТочкиУчета КАК ДействующиеТочкиУчета)) КАК бестДоговорыТочекУчетаСрезПоследних
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Услуга = &Услуга
	|	И бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети
	|ПОМЕСТИТЬ ТУНаСтруктуреСети
	|ИЗ
	|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						УслугиТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|						УслугиТочекУчета.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						УслугиТочекУчета КАК УслугиТочекУчета)) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = &СтруктураСети
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	УслугиТочекУчета.Услуга КАК Услуга,
	|	УслугиТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	УслугиТочекУчета.Договор КАК Договор,
	|	ТУНаСтруктуреСети.СтруктураСети КАК СтруктураСети
	|ПОМЕСТИТЬ УслугиТУНаСтруктуреСети
	|ИЗ
	|	УслугиТочекУчета КАК УслугиТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТУНаСтруктуреСети КАК ТУНаСтруктуреСети
	|		ПО УслугиТочекУчета.ТочкаУчета = ТУНаСтруктуреСети.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиТУНаСтруктуреСети.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА УслугиТУНаСтруктуреСети.Услуга
	|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
	|	КОНЕЦ КАК Услуга,
	|	УслугиТУНаСтруктуреСети.ОбъектРасчета КАК ОбъектРасчета,
	|	УслугиТУНаСтруктуреСети.Договор КАК Договор
	|ПОМЕСТИТЬ СоставныеУслуги
	|ИЗ
	|	УслугиТУНаСтруктуреСети КАК УслугиТУНаСтруктуреСети
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО УслугиТУНаСтруктуреСети.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоставныеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	СоставныеУслуги.Услуга КАК Услуга,
	|	СоставныеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	СоставныеУслуги.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ОтопительныйПериод.Услуга ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ОтопительныйПериод.КонецПериодаДействия <= &МоментВремени
	|				ИЛИ ОтопительныйПериод.НачалоПериодаДействия > &МоментВремени
	|	КОНЕЦ КАК УслугаОтключена
	|ПОМЕСТИТЬ УслугиПоСезонности
	|ИЗ
	|	СоставныеУслуги КАК СоставныеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтопительныйПериод КАК ОтопительныйПериод
	|		ПО СоставныеУслуги.Услуга = ОтопительныйПериод.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_ПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ТочкаУчета, УзелУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборы.ТочкаУчета КАК ТочкаУчета,
	|						ВведенныеПриборы.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ВведенныеПриборы КАК ВведенныеПриборы)) КАК бестПриборыУзловУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_АктивныеПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ТочкаУчета, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ВТ_ПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|						ВТ_ПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета
	|		ПО бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета = ВТ_ПриборыУзловУчета.ТочкаУчета
	|			И бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета = ВТ_ПриборыУзловУчета.ПриборУчета
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчета
	|ИЗ
	|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_АктивныеПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|		ВТ_АктивныеПриборыУзловУчета.ОбъектРасчета КАК ОбъектРасчета,
	|		ВТ_АктивныеПриборыУзловУчета.ПриборУчета.ВидКанальности КАК ВидКанальности,
	|		ВТ_АктивныеПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|	ИЗ
	|		ВведенныеПриборы КАК ВведенныеПриборы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктивныеПриборыУзловУчета КАК ВТ_АктивныеПриборыУзловУчета
	|			ПО ВведенныеПриборы.ТочкаУчета = ВТ_АктивныеПриборыУзловУчета.ТочкаУчета
	|				И ВведенныеПриборы.ПриборУчета = ВТ_АктивныеПриборыУзловУчета.ПриборУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Организация КАК Организация,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Район КАК Район,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Услуга КАК Услуга,
	|	бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ СостояниеУслугИндивидуальнаяСезонность
	|ИЗ
	|	РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вложенныйзапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.Шкала КАК Шкала,
	|	Вложенныйзапрос.Услуга КАК Услуга,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	бестОбъектыРасчета.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	Вложенныйзапрос.Договор КАК Договор
	|ПОМЕСТИТЬ Финал
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиПоСезонности.ОбъектРасчета КАК ОбъектРасчета,
	|		УслугиПоСезонности.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ДанныеПоПриборам.Шкала КАК Шкала,
	|		ЕСТЬNULL(УслугиПоСезонности.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ВидыДифференцированностиТочекУчета.ВидДифференцированности КАК ВидДифференцированности,
	|		УслугиПоСезонности.Договор КАК Договор
	|	ИЗ
	|		УслугиПоСезонности КАК УслугиПоСезонности
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПриборам КАК ДанныеПоПриборам
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчета КАК ВидыДифференцированностиТочекУчета
	|				ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчета.ПриборУчета
	|					И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчета.Шкала
	|			ПО (ДанныеПоПриборам.ТочкаУчета = УслугиПоСезонности.ТочкаУчета)) КАК Вложенныйзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО Вложенныйзапрос.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО Вложенныйзапрос.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Финал.ОбъектРасчета КАК ОбъектРасчета,
	|	Финал.ТочкаУчета КАК ТочкаУчета,
	|	Финал.ПриборУчета КАК ПриборУчета,
	|	Финал.Шкала КАК Шкала,
	|	Финал.Услуга КАК Услуга,
	|	Финал.ВидДифференцированности КАК ВидДифференцированности,
	|	Финал.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	Финал.Контрагент КАК Контрагент,
	|	Финал.Договор КАК Договор,
	|	ЕСТЬNULL(бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.ПустаяСсылка)) КАК Состояние
	|ПОМЕСТИТЬ Финал2
	|ИЗ
	|	Финал КАК Финал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ПО Финал.Контрагент = энргКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних
	|		ПО Финал.ТочкаУчета = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ТочкаУчета
	|			И Финал.ОбъектРасчета = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.ОбъектРасчета
	|			И Финал.Услуга = бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Услуга
	|ГДЕ
	|	Финал.ГруппаОбъектовРасчета = &ГруппаОбъектовРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Финал.ГруппаОбъектовРасчета,
	|	Финал.Контрагент,
	|	Финал.ОбъектРасчета,
	|	Финал.ТочкаУчета,
	|	Финал.ПриборУчета,
	|	Финал.Услуга,
	|	Финал.Шкала,
	|	Финал.ВидДифференцированности,
	|	Финал.Договор,
	|	ЕСТЬNULL(бестИндивидуальныеНастройкиСезонностиУслугСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Финал2.ОбъектРасчета КАК ОбъектРасчета,
	|	Финал2.ТочкаУчета КАК ТочкаУчета,
	|	Финал2.ПриборУчета КАК ПриборУчета,
	|	Финал2.Шкала КАК Шкала,
	|	Финал2.Услуга КАК Услуга,
	|	Финал2.ВидДифференцированности КАК ВидДифференцированности,
	|	Финал2.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	Финал2.Контрагент КАК Контрагент,
	|	Финал2.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА Финал2.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Финал2.Услуга.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.пустаяссылка)
	|							ИЛИ ОтопительныйПериод.Сезонность ЕСТЬ NULL
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|					КОГДА ОтопительныйПериод.НачалоПериодаДействия <= &МоментВремени
	|							И ОтопительныйПериод.КонецПериодаДействия > &МоментВремени
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|				КОНЕЦ
	|		ИНАЧЕ Финал2.Состояние
	|	КОНЕЦ КАК Состояние
	|ПОМЕСТИТЬ Финал3
	|ИЗ
	|	Финал2 КАК Финал2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтопительныйПериод КАК ОтопительныйПериод
	|		ПО Финал2.Услуга = ОтопительныйПериод.Услуга
	|			И Финал2.Услуга.Сезонность = ОтопительныйПериод.Сезонность
	|
	|СГРУППИРОВАТЬ ПО
	|	Финал2.ОбъектРасчета,
	|	Финал2.ТочкаУчета,
	|	Финал2.ПриборУчета,
	|	Финал2.Шкала,
	|	Финал2.Услуга,
	|	Финал2.ВидДифференцированности,
	|	Финал2.ГруппаОбъектовРасчета,
	|	Финал2.Контрагент,
	|	Финал2.Договор,
	|	ВЫБОР
	|		КОГДА Финал2.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Финал2.Услуга.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.пустаяссылка)
	|							ИЛИ ОтопительныйПериод.Сезонность ЕСТЬ NULL
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|					КОГДА ОтопительныйПериод.НачалоПериодаДействия <= &МоментВремени
	|							И ОтопительныйПериод.КонецПериодаДействия > &МоментВремени
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|				КОНЕЦ
	|		ИНАЧЕ Финал2.Состояние
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Финал3.ОбъектРасчета КАК ОбъектРасчета,
	|	Финал3.ТочкаУчета КАК ТочкаУчета,
	|	Финал3.Услуга КАК Услуга,
	|	Финал3.Контрагент КАК Контрагент,
	|	Финал3.Договор КАК Договор,
	|	&МоментВремени КАК ДатаОперации,
	|	ВЫБОР
	|		КОГДА &СостояниеУслуги = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|			ТОГДА Финал3.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Переподключение
	|ИЗ
	|	Финал3 КАК Финал3
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &СостояниеУслуги = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|				ТОГДА Финал3.Состояние = &СостояниеУслуги
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Финал3.Контрагент,
	|	Финал3.Договор,
	|	Финал3.Услуга,
	|	Финал3.ОбъектРасчета,
	|	Финал3.ТочкаУчета,
	|	ВЫБОР
	|		КОГДА &СостояниеУслуги = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|			ТОГДА Финал3.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";	
	
	Запрос.УстановитьПараметр("Услуга",					ТекУслуга);
	Если НЕ ЗначениеЗаполнено(ТекУслуга) Тогда
		Текст = СтрЗаменить(Текст, "			И (энргВидыУслуг.Ссылка = &Услуга)", "");
		Текст = СтрЗаменить(Текст, "бестДоговорыТочекУчетаСрезПоследних.Услуга = &Услуга", "Истина");		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГруппаОбъектовРасчета",	ТекГруппаОбъектов);
	Если НЕ ЗначениеЗаполнено(ТекГруппаОбъектов) Тогда
		Текст = СтрЗаменить(Текст, "	Финал.ГруппаОбъектовРасчета = &ГруппаОбъектовРасчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета)
	Иначе
		//Текст = СтрЗаменить(Текст, "И бестОбъектыРасчета.Ссылка = &ОбъектРасчета", "");
		Текст = СтрЗаменить(Текст, "И ОбъектРасчета = &ОбъектРасчета", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор",				Договор);
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор", "Истина");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктураСети",			СтруктураСети);
	Если НЕ ЗначениеЗаполнено(СтруктураСети) Тогда
		Текст = СтрЗаменить(Текст, "бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети = &СтруктураСети", "Истина");
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Контролер) Тогда
	//	Запрос.УстановитьПараметр("Контролер",	Контролер)
	//Иначе
	//	Текст = СтрЗаменить(Текст, "(бестОбъектыРасчета.Контролер = &Контролер)", "ИСТИНА");
	//КонецЕсли;
	
	//Если ОтборПоУзлам Тогда
	//	Если ВариантыОтбораПоУзлам = 0 Тогда
	//		Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПриборам КАК ДанныеПоПриборам", "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоПриборам КАК ДанныеПоПриборам");
	//		Текст = СтрЗаменить(Текст, "ДанныеПоПриборам.УзелУчета ЕСТЬ NULL", "ИСТИНА");
	//	КонецЕсли;
	//Иначе
	//	Текст = СтрЗаменить(Текст, "ДанныеПоПриборам.УзелУчета ЕСТЬ NULL", "ИСТИНА");
	//КонецЕсли;
	
	Запрос.Текст = Текст;
	Пакет = запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Результат = Пакет[Пакет.Количество() - 1];
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВыполнитьНаСервере()
	Запрос = Новый Запрос;
	Рок = ТЧ.Выгрузить();
	Запрос.УстановитьПараметр("Таблица", 		ТЧ.Выгрузить());
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Договор КАК Договор,
	               |	Таблица.Контрагент КАК Контрагент,
	               |	Таблица.ОбъектРасчета КАК ОбъектРасчета,
	               |	Таблица.ТочкаУчета КАК ТочкаУчета,
	               |	Таблица.ДатаОперации КАК ДатаОперации,
	               |	Таблица.Флаг КАК Флаг,
	               |	Таблица.Услуга КАК Услуга,
	               |	Таблица.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |	Таблица.НомерСтроки КАК НомерСтроки,
	               |	Таблица.Переподключение КАК Переподключение
	               |ПОМЕСТИТЬ ВрТ0
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ0.Договор КАК Договор,
	               |	ВрТ0.Контрагент КАК Контрагент,
	               |	ВрТ0.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ0.ТочкаУчета КАК ТочкаУчета,
	               |	ВЫБОР
	               |		КОГДА ВрТ0.ДатаОперации = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА &Дата
	               |		ИНАЧЕ ВрТ0.ДатаОперации
	               |	КОНЕЦ КАК ДатаОперации,
	               |	&Организация КАК Организация,
	               |	&Район КАК Район,
	               |	&Дата КАК Дата,
	               |	ВрТ0.Услуга КАК Услуга,
	               |	ВрТ0.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |	ВрТ0.НомерСтроки КАК НомерСтроки,
	               |	ВрТ0.Переподключение КАК Переподключение
	               |ПОМЕСТИТЬ ВрТ1
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |ГДЕ
	               |	ВрТ0.Флаг
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.Контрагент КАК Контрагент,
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета,
	               |	ВрТ1.ДатаОперации КАК ДатаОперации,
	               |	ВрТ1.Организация КАК Организация,
	               |	ВрТ1.Район КАК Район,
	               |	ВрТ1.Дата КАК Дата,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |	ВрТ1.НомерСтроки КАК НомерСтроки,
	               |	ВрТ1.Переподключение КАК Переподключение
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |ИТОГИ ПО
	               |	ДатаОперации";
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВидОперации = "СезонноеОтключениеУслуги" Тогда
			ТекВидОперации = Перечисления.бестВидыОпераций.бестИзменениеИндивидуальныхНастроекСезонности_ОграничениеУслуги;
			ТекстСообщения = "Отключение услуг выполнено. Созданы документы: ";
		ИначеЕсли ВидОперации = "СезонноеПодключениеУслуги" Тогда
			ТекВидОперации = Перечисления.бестВидыОпераций.бестИзменениеИндивидуальныхНастроекСезонности_ВозобновлениеУслуги;
			ТекстСообщения = "Подключение услуг выполнено. Созданы документы: ";
		КонецЕсли;
		ТекПользователь		= Пользователи.ТекущийПользователь();
		Пока Выборка.Следующий() Цикл 
			//ТекДог	= Выборка.Договор;		
			//ВыборкаДата = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Пока ВыборкаДата.Следующий() Цикл
			ТекДата				= Выборка.ДатаОперации;
			НовДок				= Документы.бестИзменениеИндивидуальныхНастроекСезонности.СоздатьДокумент();
			НовДок.ВидОперации	= ТекВидОперации;
			НовДок.Дата			= ТекДата;
			НовДок.ПериодНачисления	=  энргРаботаСПериодомДействия.ОпределитьПериодНачисления(ТекДата, Организация, Район);
			
			//НовДок.Договор		= ТекДог;
			НовДок.Организация 	= Организация;	
			НовДок.Район		= Район;
			
			ТЧТочкиУчета		= НовДок.ТочкиУчета;
			ВыборкаДетали		= Выборка.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				НовСтрока		= ТЧТочкиУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетали);								
			КонецЦикла;
			НовДок.Ответственный= ТекПользователь;
			НовДок.Примечание	= "Создан обработкой";
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			
			ВыборкаНов = Выборка.Выбрать();
			Пока ВыборкаНов.Следующий() Цикл 
			Для Каждого  СтрТЧ из ТЧ Цикл
				Если  СтрТЧ.Договор = ВыборкаНов.Договор и СтрТЧ.Контрагент = ВыборкаНов.Контрагент 
					и СтрТЧ.ОбъектРасчета= ВыборкаНов.ОбъектРасчета и СтрТЧ.ТочкаУчета = ВыборкаНов.ТочкаУчета и СтрТЧ.Услуга = ВыборкаНов.Услуга Тогда  
					СтрТЧ.СсылкаНАДокумент = НовДок.Ссылка;
				КонецЕсли;
			КонецЦикла; КонецЦикла;
			
			ТекстСообщения = ТекстСообщения + НовДок.Ссылка + "; ";
			//КонецЦикла;
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередВыполнениемОбработки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			ВыполнитьНаСервере();
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбора()
	
	СписокУслуг = Новый СписокЗначений; 	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	РегистрСведений.бестИндивидуальныеНастройкиСезонностиУслуг.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестУслугиТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестУслугиТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, Услуги.Услуга) КАК Услуга
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО Услуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка";
	
	
	
	Если Не ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "ИСТИНА");
	Иначе 
		Запрос.УстановитьПараметр("ОбъектРасчета",ОбъектРасчета);
	КонецЕсли;	
	
	
	
	Запрос.УстановитьПараметр("Район",Район);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Период",?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	
	РезультатЗапроса 		= Запрос.Выполнить();   	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Район) Тогда 
		Организация =Район.Организация;
	иначе 
		Организация = Неопределено;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти
